{"format": "graph-model", "generatedBy": "2.15.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_3": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "90"}, {"size": "258"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "21"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_4/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_4/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "258"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_4/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_5/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_5/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_5/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_8/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "21"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "21"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_3", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "90"}, {"size": "258"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_111", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_112", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_113", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_105", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_51", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_52", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_53", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_45", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_43", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_103", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_4/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["input_3", "StatefulPartitionedCall/sequential_2/conv1d_4/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_106", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/merge/_122", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_111", "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/next_iteration/_158"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/merge/_123", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_112", "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/next_iteration/_159"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/merge/_124", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_113", "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/next_iteration/_160"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/merge/_116", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_105", "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/next_iteration/_152"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_62", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_51", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_98"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_63", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_52", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_99"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_64", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_53", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_100"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_56", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_45", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_92"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_54", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_43", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_90"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/merge/_114", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_103", "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/next_iteration/_150"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_4/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d_4/Conv1D/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d_4/Conv1D/ExpandDims_1", "StatefulPartitionedCall/sequential_2/conv1d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/merge/_117", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_106", "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/next_iteration/_153"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_4/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d_4/Conv1D"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_4/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_4/Relu", "StatefulPartitionedCall/sequential_2/max_pooling1d_4/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_4/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "2", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_4/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_4/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_5/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_4/Squeeze", "StatefulPartitionedCall/sequential_2/conv1d_5/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_5/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/conv1d_5/Conv1D/ExpandDims", "StatefulPartitionedCall/sequential_2/conv1d_5/Conv1D/ExpandDims_1", "StatefulPartitionedCall/sequential_2/conv1d_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_5/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv1d_5/Conv1D"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv1d_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/conv1d_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_5/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv1d_5/Relu", "StatefulPartitionedCall/sequential_2/max_pooling1d_5/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_5/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "2", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling1d_5/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_5/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_5/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/max_pooling1d_5/Squeeze", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/Shape", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/strided_slice", "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/strided_slice", "StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_50", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed", "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed", "StatefulPartitionedCall/sequential_2/lstm_4/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_61", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_50", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_97"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_49", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_48", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_47", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_46", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_60", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_49", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_96"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_59", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_48", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_95"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_58", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_47", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_94"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_57", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/enter/_46", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_93"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/cond/_41/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_56", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_60", "^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_54"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/cond/_41/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_21_switch/_71", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_59", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_73", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_61", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_22_switch/_74", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_62", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_20_switch/_70", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_58", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_23_switch/_75", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_63", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_24_switch/_76", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_64", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/time_switch/_68", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_56", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_counter_switch/_66", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_54", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2_1_switch/_69", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_57", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice_switch/_72", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/merge/_60", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_counter_switch/_66:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/exit/_81", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2_1_switch/_69"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_97", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_73:1", "^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_98", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_22_switch/_74:1", "^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_99", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_23_switch/_75:1", "^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_20_switch/_70:1", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_23_switch/_75:1", "^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_100", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_24_switch/_76:1", "^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/input/_177", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/time_switch/_68:1", "^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_96", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/strided_slice_switch/_72:1", "^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/exit/_81", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_73:1", "Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/input/_177", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/input/_177", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_counter_switch/_66:1", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/input/_22_switch/_74:1", "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/MatMul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_92", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/add_2", "^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/next_iteration/_90", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/body/_42/while/add_3", "^StatefulPartitionedCall/sequential_2/lstm_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/while/enter/_110", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": 