{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer_5": {"name": "input_layer_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "258"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "258"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling1d_10_1/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling1d_11_1/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_5", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "258"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_11_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_5_1/lstm_11_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["input_layer_5", "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5_1/conv1d_10_1/convolution/ExpandDims", "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_5_1/conv1d_10_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_5_1/conv1d_10_1/convolution/Squeeze", "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_10_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5_1/conv1d_10_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling1d_10_1/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_5_1/conv1d_10_1/Relu", "StatefulPartitionedCall/sequential_5_1/max_pooling1d_10_1/MaxPool1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling1d_10_1/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling1d_10_1/MaxPool1d/ExpandDims"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling1d_10_1/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling1d_10_1/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling1d_10_1/MaxPool1d/Squeeze", "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5_1/conv1d_11_1/convolution/ExpandDims", "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_5_1/conv1d_11_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_5_1/conv1d_11_1/convolution/Squeeze", "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv1d_11_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5_1/conv1d_11_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling1d_11_1/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_5_1/conv1d_11_1/Relu", "StatefulPartitionedCall/sequential_5_1/max_pooling1d_11_1/MaxPool1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling1d_11_1/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling1d_11_1/MaxPool1d/ExpandDims"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling1d_11_1/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling1d_11_1/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling1d_11_1/MaxPool1d/Squeeze", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling1d_11_1/MaxPool1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/transpose", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/Shape", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/strided_slice/stack", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/strided_slice", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/strided_slice", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros/packed", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1/packed", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvbHN0bV8xMF8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvbHN0bV8xMF8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/Max", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvbHN0bV8xMF8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/loop_counter", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvbHN0bV8xMF8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvbHN0bV8xMF8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_26", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvbHN0bV8xMF8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/time", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvbHN0bV8xMF8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_28", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_5", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvbHN0bV8xMF8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_29", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_6", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvbHN0bV8xMF8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_30", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_7", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopControlInputs/_31"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvbHN0bV8xMF8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_24", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_59"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_27", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_62"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_22", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_57"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_21", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_56"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_25", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_60"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_26", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_61"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_23", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_58"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/input_control_node/_107", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_28", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_29", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_30", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_32", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_33", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_34", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_35", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_36", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_37", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/sequential_5_1/lstm_10_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_32", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_33", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/input_control_node/_107"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/sequential_5_1/lstm_10_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/input_control_node/_107"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/sequential_5_1/lstm_10_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_34", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/sequential_5_1/lstm_10_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/sequential_5_1/lstm_10_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/sequential_5_1/lstm_10_1/while/Less_1", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/sequential_5_1/lstm_10_1/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopCond/_39", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/cond/_19/sequential_5_1/lstm_10_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/Max_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_33", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopCond/_39"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/loop_counter_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_32", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopCond/_39"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1_switch/_45", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_37", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopCond/_39"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor_switch/_46", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_38", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopCond/_39"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/time_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_34", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopCond/_39"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_switch/_44", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_36", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopCond/_39"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2_1_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/merge/_35", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/LoopCond/_39"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/Max_switch/_41"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/loop_counter_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/loop_body_control/_47", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/loop_counter_switch/_40:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/exit/_53", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1_switch/_45"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/exit/_54", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor_switch/_46"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/time_switch/_42"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/exit/_52", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_switch/_44"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/exit/_51", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2_1_switch/_43"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/Max_switch/_41", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor_switch/_46", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2_1_switch/_43", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/time_switch/_42", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/loop_body_control/_47", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_1_switch/_45", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_switch/_44", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_28", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_29", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_30"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/exit/_51", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "7"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input/_122", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/time_switch/_42:1", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_28", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_29", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/enter/_30", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_5_1/lstm_11_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/loop_counter_switch/_40:1", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input/_122", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor_switch/_46:1", "Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input/_122", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/zeros_switch/_44:1", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/output_control_node/_140", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_62", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/TensorArrayUnstack/TensorListFromTensor_switch/_46:1", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/output_control_node/_140", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_57", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/StatefulPartitionedCall/sequential_5_1/lstm_10_1/Max_switch/_41:1", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/output_control_node/_140", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/NoOp", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/input_control_node/_119"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_56", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/add_1", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/output_control_node/_140", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/next_iteration/_58", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/add", "^Func/StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/output_control_node/_140", "^StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_11_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_11_1/Shape", "StatefulPartitionedCall/sequential_5_1/lstm_11_1/strided_slice/stack", "StatefulPartitionedCall/sequential_5_1/lstm_11_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_5_1/lstm_11_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/lstm_10_1/while/body/_20/sequential_5_1/lstm_10_1/while/lstm_cell_1/add"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, 